scc2425-tukano/src/artillery/user_test.yaml
config:
  target: http://127.0.0.1:8080/tukano/rest
  plugins:
    metrics-by-endpoint: {}
#  http:
#    timeout: 10
  processor: ./test-utils.js
  phases:
    - name: "User-testing"
      duration: 1
      arrivalRate: 1
#  payload:
#    path: ../data/users.csv
#    #order: sequence # selects users sequentially, default is random
#    loadAll: true # load the whole CSV
#    name: auth
#    #skipHeader: true # The first line is a header, so we want to skip it
#    #delimiter: "," # standard delimiter
#    #skipEmptyLines: true # not important in our case
#    fields:
#      - "userid"
#      - "pwd"
#      - "email"
#      - "displayName"

#Post Test Example: scenarios
scenarios:
  #- name: TuKanoRegister
  - flow:
      - loop:
          - # User creation
          - post:
              url: /users/
              headers:
                Content-Type: application/json
              afterResponse: "printStatus"
              json:
                userId: "kGallagher"
                pwd: "easypass"
                email: "kgallagher@gmail.com"
                displayName: "Gallagher"
          - post:
              url: /users/
              headers:
                Content-Type: application/json
              afterResponse: "printStatus"
              json:
                userId: "SergioDuarte"
                pwd: "easypass"
                email: "smd@gmail.com"
                displayName: "SergioD"
          #User gets
          - get:
              url: /users/kGallagher?pwd=easypass
              headers:
                "Content-Type": "application/json"
              afterResponse: "printStatus"
          - get:
              url: /users/SergioDuarte?pwd=easypass
              headers:
                "Content-Type": "application/json"
              afterResponse: "printStatus"
          #User updates
          - put:
              url: /users/kGallagher?pwd=easypass
              headers:
                "Content-Type": "application/json"
              json:
                userId: "kGallagher"
                pwd: "newpass"
                email: "newgallagher@gmail.com"
                displayName: "Gallagher Updated"
              afterResponse: "printStatus"
          - get:
              url: /users/kGallagher?pwd=newpass
              headers:
                "Content-Type": "application/json"
              afterResponse: "printStatus"
          #User search
          - get:
              url: /users/?query=Ga
              headers:
                "Content-Type": "application/json"
              afterResponse: "printStatus"
          - post:
              url: /users/
              headers:
                Content-Type: application/json
              afterResponse: "printStatus"
              json:
                userId: "kGallagher2"
                pwd: "easypass2"
                email: "kgallagher2@gmail.com"
                displayName: "Gallagher2"
          - get:
              url: /users/?query=Ga
              headers:
                "Content-Type": "application/json"
              afterResponse: "printStatus"
          #User delete
          - delete:
              url: /users/kGallagher?pwd=newpass
              headers:
                "Content-Type": "application/json"
              afterResponse: "printStatus"
          - delete:
              url: /users/SergioDuarte?pwd=easypass
              headers:
                "Content-Type": "application/json"
              afterResponse: "printStatus"